#### Q1. What is a database? Differentiate between SQL and NoSQL databases

Database, also called electronic database, any collection of data, or information, that is specially organized for rapid search and retrieval by a computer. Databases are structured to facilitate the storage, retrieval, modification, and deletion of data in conjunction with various data-processing operations. A database management system (DBMS) extracts information from the database in response to queries.

SQL
- RELATIONAL DATABASE MANAGEMENT SYSTEM (RDBMS)
- These databases are not suited for hierarchical data storage.
- These databases have fixed or static or predefined schema.
- Follows ACID property.
- Vertically Scalable.
- These databases are best suited for complex queries
- Examples: MySQL, PostgreSQL, Oracle, MS-SQL Server, etc

NOSQL
- Non-relational or distributed database system.
- They have dynamic schema
- These databases are best suited for hierarchical data storage.
- These databases are not so good for complex queries
- Horizontally scalable
- Follows CAP(consistency, availability, partition tolerance)
- Examples: MongoDB, GraphQL, HBase, Neo4j, Cassandra, etc

#### Q2. What is DDL? Explain why CREATE, DROP, ALTER, and TRUNCATE are used with an example

DDL stand for Data Defination Language.

- CREATE: This command is used to create the database or its objects (like table, index, function, views, store procedure, and triggers).
- DROP: This command is used to delete objects from the database.
- ALTER: This is used to alter the structure of the database.
- TRUNCATE: This is used to remove all records from a table, including all spaces allocated for the records are removed.

###### CREATING TABLE and INSERTING VALUES

In [35]:
import mysql.connector
mydb = mysql.connector.connect(
host = "localhost",
user = "Prakash",
password = "1234")
mycursor = mydb.cursor()

In [45]:
## Creating a data base and table
mycursor.execute("create database if not exists Employee ")
sql = "create table if not exists employee.details (name varchar(50), salary INT , Age INT, Location Varchar(50))"
mycursor.execute(sql)

In [46]:
## inserting data into the table 
mycursor.execute(" insert into employee.details values ('Singh', 91000 , 21 , 'Kolkata')")
mydb.commit()

In [47]:
## insertig multiple values 
mycursor.execute(" insert into employee.details values ('Singh', 91000 , 21 , 'Kolkata'),('Rathore',12000,25,'Hyedrabad'),('Khan',80000,55,'Mumbai')")
mydb.commit()

In [48]:
### using select statement to view the data inside the details table
mycursor.execute("SELECT * FROM employee.details")
records = mycursor.fetchall()

# print the records
for record in records:
    print(record)

('Singh', 91000, 21, 'Kolkata')
('Singh', 91000, 21, 'Kolkata')
('Rathore', 12000, 25, 'Hyedrabad')
('Khan', 80000, 55, 'Mumbai')

###### AlLTER TABLE

In [49]:
## Creating a new column (Geder_) in an existing table details
mycursor.execute("Alter table  employee.details add column Gender_ char")
mydb.commit()

In [51]:
##  tabulate helps is showing the data inside a table in a tabular format
from tabulate import tabulate
mycursor.execute("select * from employee.details")
result_set = mycursor.fetchall()

# display the data in a table format
print(tabulate(result_set, headers=mycursor.column_names))

name       salary    Age  Location    Gender_
-------  --------  -----  ----------  ---------
Singh       91000     21  Kolkata
Singh       91000     21  Kolkata
Rathore     12000     25  Hyedrabad
Khan        80000     55  Mumbai

###### DROP TABLE

In [14]:
mycursor.execute("Create table if not exists employee.Student ( name char , sec char , marks int)")
mycursor.execute("INSERT INTO employee.Student VALUES ( 'S','A',89)")
mydb.commit()

In [15]:
##  tabulate helps is showing the data inside a table in a tabular format
from tabulate import tabulate
mycursor.execute("select * from employee.Student")
result_set = mycursor.fetchall()

# display the data in a table format
print(tabulate(result_set, headers=mycursor.column_names))

name    sec      marks
------  -----  -------
S       A           89

In [16]:
## drop table
mycursor.execute("DROP TABLE employee.Student")

###### TRUNCATE

In [29]:
### truncate the tableb details
mycursor.execute("TRUNCATE TABLE employee.details")

In [1]:
import mysql.connector
mydb = mysql.connector.connect(
host = "localhost",
user = "Prakash",
password = "1234")
mycursor = mydb.cursor()
mydb.start_transaction()
mycursor.execute("TRUNCATE TABLE employee.details")

In [2]:
mydb.rollback()

In [3]:
### Truncate deleted all the data but retained the structure of the table
##  tabulate helps is showing the data inside a table in a tabular format
from tabulate import tabulate
mycursor.execute("select * from employee.details")
result_set = mycursor.fetchall()

# display the data in a table format
print(tabulate(result_set, headers=mycursor.column_names))

name    salary    Age    Location    Gender_
------  --------  -----  ----------  ---------

#### Q3. What is DML? Explain INSERT, UPDATE, and DELETE with an example

DML stands for Data Manupulation Language.

###### INSERT
The INSERT statement is used to add one or more rows of data to a table.

In [37]:
### inserting data inside the table 
mycursor.execute("Create table if not exists employee.Student ( name char , sec char , marks int)")
mycursor.execute("INSERT INTO employee.Student VALUES ( 'S','A',89)")
mydb.commit()

In [9]:
mycursor.execute("select * from employee.Student")
r = mycursor.fetchall()
for i in r :
    print(i)

('S', 'A', 89)

###### UPDATE
An update operation is used to modify the data that already exists in a database or data structure.

In [13]:
mycursor.execute("Update employee.Student SET name = 'P' , sec = 'B',marks = 99 where name = 'S'")

In [15]:
## successfully updated the record
mycursor.execute("SELECT * FROM employee.Student")
result_set = mycursor.fetchall()
print(tabulate(result_set, headers=mycursor.column_names))

name    sec      marks
------  -----  -------
P       B           99

###### DELETE 
A delete operation is used to remove data from a database or data structure. It allows you to permanently delete a record or row from a table, removing all of its associated data.

In [29]:
s = "DELETE FROM employee.Student WHERE marks = 99 "
mycursor.execute(s)
mydb.commit()

In [36]:
## sucssesfully deleted the record associated with marks 99
mycursor.execute("SELECT * FROM employee.Student ")
result_set = mycursor.fetchall()
print(tabulate(result_set, headers=mycursor.column_names))

name    sec      marks
------  -----  -------
S       A           89

#### Q4. What is DQL? Explain SELECT with an example

DQL stands for Data Query Language. It is a subset of SQL (Structured Query Language) used for retrieving data from a database. DQL commands are used to retrieve, manipulate and analyze data in a database. DQL is one of the four types of SQL commands, which include Data Definition Language (DDL), Data Manipulation Language (DML), and Data Control Language (DCL) eg,

- where,orderby, groupby,having

In [62]:
mycursor.execute("SELECT * FROM employee.details")
records = mycursor.fetchall()

# print the records
for record in records:
    print(record)

('Prakash', 50000, 21, 'Kolkata')
('Prakash', 50000, 21, 'Kolkata')
('Singh', 91000, 21, 'Kolkata')
('Singh', 91000, 21, 'Kolkata')
('Rathore', 12000, 25, 'Hyedrabad')
('Khan', 80000, 55, 'Mumbai')
('Singh', 91000, 21, 'Kolkata')
('Singh', 91000, 21, 'Kolkata')
('Rathore', 12000, 25, 'Hyedrabad')
('Khan', 80000, 55, 'Mumbai')

#### Q5. Explain Primary Key and Foreign Key

PRIMARY KEY
- It uniquely identifies a record in the relational database table.
- Primary key is used to ensure data in the specific column is unique.
- Only one primary key is allowed in a table
- It is a combination of UNIQUE and Not Null constraints
- It does not allow NULL values.
- Its value cannot be deleted from the parent table.
- It constraint can be implicitly defined on the temporary tables.

FOREIGN KEY
- A foreign key is a column or group of columns in a relational database table that provides a link between data in two tables.
- It refers to the field in a table which is the primary key of another table.
- More than one foreign key are allowed in a table.
- It can contain duplicate values and a table in a relational database.
- Its value can be deleted from the child table.
- It constraint cannot be defined on the local or global temporary tables.

#### Q6. Write a python code to connect MySQL to python. Explain the cursor() and execute() method.

 The cursor() method creates a cursor object which allows the execution of SQL statements on a database. The execute() method is used to execute an SQL statement and can accept parameters as input.

In [52]:
import mysql.connector
mydb = mysql.connector.connect(
host = "localhost",
user = "Prakash",
password = "1234")
mycursor = mydb.cursor()
print(mydb)
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001E542808130>
('employee',)
('information_schema',)
('mysql',)
('performance_schema',)
('sys',)

#### Q7. Give the order of execution of SQL clauses in an SQL query

- SELECT: This clause specifies which columns to select from the table(s) being queried. It is usually the first clause in an SQL query and is mandatory in most cases.

- FROM: This clause specifies the table(s) from which the data is being selected. It is usually the second clause in an SQL query and is mandatory in most cases.

- WHERE: This clause specifies the conditions that must be met for a row to be included in the result set. It is usually the third clause in an SQL query and is optional. If omitted, all rows that match the other clauses will be included in the result set.

- GROUP BY: This clause is used to group the result set by one or more columns. It is usually the fourth clause in an SQL query and is optional.

- HAVING: This clause is used to filter the result set based on aggregate functions such as SUM, COUNT, AVG, etc. It is usually the fifth clause in an SQL query and is optional.

- ORDER BY: This clause is used to sort the result set by one or more columns in ascending or descending order. It is usually the sixth clause in an SQL query and is optional.

- LIMIT/OFFSET: These clauses are used to limit the number of rows returned by the query and to specify an offset for the starting row. They are usually the last clauses in an SQL query and are optional. If omitted, all rows that match the other clauses will be returned.